//-----------------------------------------------------------------------------------------------------------
// Copyright (C) 2016-2017 Rival
// 版权所有
//
// 文件名：C2SEventCode.cs
//
// 文件功能描述：
//
// 服务端向客户端广播事件类别
//
// 创建标识：taixihuase 20160315
//
// 修改标识：
// 修改描述：
// 
//
// 修改标识：
// 修改描述：
//
//-----------------------------------------------------------------------------------------------------------

namespace C2SProtocol.Common
{
    /// <summary>
    /// 类型：枚举
    /// 名称：C2SEventCode
    /// 作者：taixihuase
    /// 作用：客户端服务端之间事件代码枚举值
    /// 编写日期：2016/3/15
    /// </summary>
    public enum C2SEventCode
    {
        SocketExist,
    }
}
