//-----------------------------------------------------------------------------------------------------------
// Copyright (C) 2016-2017 Rival
// 版权所有
//
// 文件名：C2SOpCode.cs
//
// 文件功能描述：
//
// 客户端操作类别
//
// 创建标识：taixihuase 20160125
//
// 修改标识：
// 修改描述：
// 
//
// 修改标识：
// 修改描述：
//
//-----------------------------------------------------------------------------------------------------------

namespace C2SProtocol.Common
{
    /// <summary>
    /// 类型：枚举
    /// 名称：C2SOpCode
    /// 作者：taixihuase
    /// 作用：客户端操作代码枚举值
    /// 编写日期：2016/1/25
    /// </summary>
    public enum C2SOpCode
    {
        Login,
        RegistCheck,
        Regist,
        ApplyForCaptcha,
    }
}
