//-----------------------------------------------------------------------------------------------------------
// Copyright (C) 2016-2017 Rival
// 版权所有
//
// 文件名：C2SParaCode.cs
//
// 文件功能描述：
//
// 数据包传输的参数类别
//
// 创建标识：taixihuase 20160125
//
// 修改标识：
// 修改描述：
// 
//
// 修改标识：
// 修改描述：
//
//-----------------------------------------------------------------------------------------------------------


namespace C2SProtocol.Common
{
    /// <summary>
    /// 类型：枚举
    /// 名称：C2SParaCode
    /// 作者：taixihuase
    /// 作用：数据参数代码枚举值
    /// 编写日期：2016/1/25
    /// </summary>
    public enum C2SParaCode
    {
        /// <summary>
        /// 登录参数
        /// </summary>
        Login,

        /// <summary>
        /// 注册参数
        /// </summary>
        Regist,

        /// <summary>
        /// 邮箱参数
        /// </summary>
        Email,
    }
}
