//-----------------------------------------------------------------------------------------------------------
// Copyright (C) 2016-2017 Rival
// 版权所有
//
// 文件名：S2SRetCode.cs
//
// 文件功能描述：
//
// 服务器接收请求后，执行请求操作并反馈操作的执行情况
//
// 创建标识：taixihuase 20160125
//
// 修改标识：
// 修改描述：
// 
//
// 修改标识：
// 修改描述：
//
//-----------------------------------------------------------------------------------------------------------

namespace S2SProtocol.Common
{
    /// <summary>
    /// 类型：枚举
    /// 名称：S2SRetCode
    /// 作者：taixihuase
    /// 作用：服务器间操作执行情况枚举值
    /// 编写日期：2016/1/25
    /// </summary>
    public enum S2SRetCode
    {
        Success,
        Failure,
        UnknownError
    }
}
